/*********************************Copyright (c)**********************************
**
**                        河南许继智能科技股份有限公司
**                              www.xjpmf.com
**
**-----------------------------------文件信息-----------------------------------
**  项目名称    ：remote_management_service通用库
**  文    件    ：remote_management_service.h
**  作    者    ：李鹏博
**  版    本    ：1.00
**  创建日期    ：2025-09-17
**  描    述    ：remote_management_service接口定义
**
**-----------------------------------历史版本-----------------------------------
**  作    者    ：
**  版    本    ：
**  修改日期    ：
**  描    述    ：
**
********************************************************************************/

#ifndef _REMOTE_MANAGEMENT_SEVICE_H_
#define _REMOTE_MANAGEMENT_SEVICE_GLOBALS_H_


#ifdef  REMOTE_MANAGEMENT_SEVICE_GLOBALS
#define REMOTE_MANAGEMENT_SEVICE_EXT
#else
#define  REMOTE_MANAGEMENT_SEVICE_EXT  extern
#endif

/******************************************************************************
**C库头文件
******************************************************************************/

/******************************************************************************
**底层驱动平台头文件
******************************************************************************/

/******************************************************************************
**基础平台头文件
******************************************************************************/

/******************************************************************************
**应用头文件
******************************************************************************/

#ifdef __cplusplus
extern "C" {
#endif
/******************************************************************************
**宏定义
******************************************************************************/

/******************************************************************************
**枚举定义
******************************************************************************/

/******************************************************************************
**结构类型定义
******************************************************************************/

/******************************************************************************
**全局变量定义
******************************************************************************/
typedef enum
{
	REMOTE_MANAGEMENT_DEBUG,        //调试信息
	REMOTE_MANAGEMENT_INFO,         //运行信息
	REMOTE_MANAGEMENT_WARN,         //告警信息
	REMOTE_MANAGEMENT_ERROR,        //可恢复类错误信息
	REMOTE_MANAGEMENT_FATAL,        //致命错误信息
}REMOTE_MANAGEMENT_ULOG_LEVEL;
/******************************************************************************
**API函数实现
******************************************************************************/
REMOTE_MANAGEMENT_SEVICE_EXT void remote_management_fire_event(u32 service_id, const char *msg);
REMOTE_MANAGEMENT_SEVICE_EXT void remote_management_fire_ulog(REMOTE_MANAGEMENT_ULOG_LEVEL level, const char *msg);
REMOTE_MANAGEMENT_SEVICE_EXT void remote_management_fire_protocol_message(u32 service_id,u32 dev_id,SERVICE_PROTOCOL_TYPE protocol_type, const char *msg,u16 len);

#ifdef __cplusplus
}
#endif
#endif   /* end */

